{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 3, "name": "convolution2d_1", "activation": "elu", "b_regularizer": null, "batch_input_shape": [null, 40, 160, 3], "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "nb_row": 1, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 1, "bias": true, "input_dtype": "float32", "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_2", "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "elu", "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "nb_filter": 32, "bias": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_3", "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "elu", "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "nb_filter": 32, "bias": true, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_4", "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "elu", "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "nb_filter": 64, "bias": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_5", "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "elu", "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "nb_filter": 64, "bias": true, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_3", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_6", "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "elu", "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "nb_filter": 128, "bias": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_7", "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "elu", "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "nb_filter": 128, "bias": true, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_4", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten"}}, {"class_name": "Dense", "config": {"output_dim": 512, "trainable": true, "name": "dense_1", "activation": "elu", "b_regularizer": null, "init": "glorot_uniform", "input_dim": 2560, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 128, "trainable": true, "name": "dense_2", "activation": "elu", "b_regularizer": null, "init": "glorot_uniform", "input_dim": 512, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 16, "trainable": true, "name": "dense_3", "activation": "elu", "b_regularizer": null, "init": "glorot_uniform", "input_dim": 128, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 1, "trainable": true, "name": "dense_4", "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "input_dim": 16, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null}}]}